cases/05_navier_stokes_equation/16_lid_driven_cavity_piso_Re1000_hybrid40/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /    O  peration     |
    \  /    A nd           |
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

// 本项目使用运动学压力：
//
//     p_k = p / ρ
//
// 初始压力：
//
//     p_k(x,y,0) = 0
//
// 固壁法向压力条件：
//
//     ∂p_k/∂n = 0
//
// 压力参考自由度在 system/fvSolution/PISO 中设置。
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    leftWall
    {
        type zeroGradient;
    }
    rightWall
    {
        type zeroGradient;
    }
    bottomWall
    {
        type zeroGradient;
    }
    movingTop
    {
        type zeroGradient;
    }
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
}
